tsung_logs/nov22-no_opt/critical.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="nov22.68y62yyn3s.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
        <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="open-app-view-posts" probability="30" type="ts_http">
      <request>
	  <http url="/" version="1.1" method="GET"/>
	</request>
      <thinktime value="2" random="true"/>
      <request>
        <http url="/posts/" version="1.1" method="GET"/>
      </request>
      <thinktime value="10" random="true"/>
      <request>
        <http url="/spiciest/" version="1.1" method="GET"/>
      </request>
      <thinktime value="10" random="true"/>
    </session>
    <session name="http-example" probability="20" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>
      <thinktime value="2" random="true"/>
      <request>
	<http url="/posts/1" version="1.1" method="GET"/> 
      </request>
      <thinktime value="5" random="true"/>
    </session>
    <session name="sign-in" probability="50" type="ts_http">
      <request>
	<http url="/users/sign_up" version="1.1" method="GET"/>
      </request>
      <setdynvars sourcetype="random_string" start="1000" end="9999999">
          <var name="random_username"/>
      </setdynvars>
      <setdynvars sourcetype="random_string" start="1000" end="9999999">
        <var name="random_password"/>
      </setdynvars>
      <request subst="true">
          <http url="/" version="1.1" method="POST" contents="user%5Bemail%5D=%%%%_random_username%%@gmail.com&amp;user%5Bpassword%5D=%%_random_password%%&amp;user%5Bpassword_confirmation%5D=%%_random_password%%&amp;commit=Sign+up">
          </http>
      </request>
      <thinktime value="2" random="true"/>
      <thinktime value="3" random="true"/>
      <request subst="true">
        <dyn_variable name="new_post_url" re="[Ll]ocation: (http://.*)\r"/>
        <http url="/" version="1.1" method="POST" contents="comment%5Bbody%5D=%%this-is-a-comment&amp;commit=Save">
        </http>
      </request>
      <thinktime value="3" random="true"/>
      <request subst="true">
        <http url="%%_created_submission_url%%" method="DELETE"/>
      </request>
      <request subst="true">
        <http url="/users/sign_out" version="1.1" method="DELETE">
        </http>
      </request>
    </session>
  </sessions>
</tsung>